Tekla.Structures.Drawing.LeaderLine
The LeaderLine class defines a leader line attached to a parent object, for example a Text or a Mark.
The LeaderLine can be modified to add/remove elbow points or to change where it is pointing.
using Tekla.Structures.Drawing;
using Point = Tekla.Structures.Geometry3d.Point;
public class Example
{
public void Example1()
{
DrawingHandler DrawHandler = new DrawingHandler();
Drawing CurrentDrawing = DrawHandler.GetActiveDrawing();
ContainerView Sheet = CurrentDrawing.GetSheet();
DrawingObjectEnumerator AllViews = Sheet.GetViews();
while(AllViews.MoveNext())
{
if(AllViews.Current is View)
{
View CurrentView = (View)AllViews.Current;
Point MyInsertionPoint = new Point(200, 600);
Text.TextAttributes MyTextAttributes = new Text.TextAttributes();
// Here we create one Text with a LeaderLine attached to it.
MyTextAttributes.PreferredPlacing = PreferredTextPlacingTypes.LeaderLinePlacingType();
Text MyText = new Text(CurrentView, MyInsertionPoint, "Text with a LeaderLine.",
new LeaderLinePlacing(new Point(10, 10)), MyTextAttributes);
MyText.Insert();
// Next we enumerate through all its children, which in this case is the LeaderLine.
DrawingObjectEnumerator TextChildren = MyText.GetObjects();
while(TextChildren.MoveNext())
{
if(TextChildren.Current is LeaderLine)
{
// We then modify the LeaderLine to contain some elbow points of our choosing.
LeaderLine CurrentLeaderLine = (LeaderLine)TextChildren.Current;
CurrentLeaderLine.ElbowPoints.Add(new Point(50, 250));
CurrentLeaderLine.ElbowPoints.Add(new Point(150, 250));
CurrentLeaderLine.Modify();
CurrentLeaderLine.Delete();
}
}
}
else
{
AllViews = ((ContainerView)AllViews.Current).GetViews();
}
}
}
}

Tekla.Structures.Drawing.LeaderLine.StartPoint
The starting point of the leader line.

Tekla.Structures.Drawing.LeaderLine.EndPoint
The end point of the leader line (set by the parent object).

Tekla.Structures.Drawing.LeaderLine.ElbowPoints
The leader line's elbow points (middle points).

Tekla.Structures.Drawing.LeaderLine.LeaderLineType
Gets the type of the leader line.
For a list of the available leader line types see Tekla.Structures.Drawing.LeaderLine.LeaderLineTypes.

Tekla.Structures.Drawing.LeaderLine.Initialize
Initializes the standard values for LeaderLine

Tekla.Structures.Drawing.LeaderLine.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.LeaderLine.Insert
A leader line cannot be inserted.
Returns: An exception.

Tekla.Structures.Drawing.LeaderLine.Select
Selects the leader line from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.LeaderLine.Modify
Modifies the leader line in the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.LeaderLine.Delete
A leader line cannot be deleted.
Returns: An exception.